brianreborn/pqfreebsd_kernel/man/man4/pqk_zfs_ea.4
.\" Copyright (c) 2026 Brian Fundakowski Feldman.
.\" Light-ware License — see LICENSE at the repository root.
.Dd August 23, 2026
.Dt PQK_ZFS_EA 4
.Os
.Sh NAME
.Nm pqk_zfs_ea
.Nd set MNT_MULTILABEL on ZFS mounts with xattr enabled
.Sh SYNOPSIS
To compile this module into the kernel, place the sources under
.Pa sys/modules/pqk_zfs_ea
and build with
.Xr bsd.kmod.mk 7 .
.Pp
To load the module at boot time, add the following line to
.Xr loader.conf 5 :
.Bd -literal -offset indent
pqk_zfs_ea_load="YES"
.Ed
.Pp
To load the module at run time:
.Bd -literal -offset indent
kldload pqk_zfs_ea
.Ed
.Sh DESCRIPTION
The
.Nm
module walks active ZFS mounts and, for each mount whose effective
.Cm xattr
property is
.Cm on
(also known as
.Cm dir )
or
.Cm sa
— whether that setting is local to the dataset or inherited —
sets
.Dv MNT_MULTILABEL
on
.Va mp->mnt_flag .
That flag is what TrustedBSD MAC uses to decide that object labels may
be stored as extended attributes on the file system.
.Pp
On
.Dv MOD_LOAD
the module scans every mounted file system.
It also registers a
.Dv vfs_mounted
event handler so later ZFS mounts are tagged the same way.
.Pp
Mount-time options
.Cm noxattr ,
.Cm xattr ,
.Cm dirxattr ,
and
.Cm saxattr
override the dataset property when present on
.Va mnt_opt ,
matching OpenZFS
.Fn zfs_register_callbacks
ordering.
Otherwise the effective property is read with
.Fn dsl_prop_get_integer .
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 8
variables are available under
.Va debug.pqk_zfs_ea :
.Bl -tag -width "verbose"
.It Va verbose
If non-zero, log every mount considered.
.It Va scan
Write a non-zero value to rescan all ZFS mounts.
.It Va scanned , tagged , skipped , errors
Counters.
.El
.Sh LOCKING
Mount-list iteration uses
.Va mountlist_mtx
and
.Fn vfs_busy
with
.Dv MBF_NOWAIT
and
.Dv MBF_MNTLSTLOCK .
.Dv MNT_MULTILABEL
is updated under
.Fn MNT_ILOCK .
Property lookup is performed only after
.Va mountlist_mtx
has been dropped, because
.Fn dsl_prop_get_integer
may sleep on
.Va spa_namespace_lock .
.Sh SEE ALSO
.Xr mac 4 ,
.Xr zfs 8 ,
.Xr kldload 8 ,
.Xr loader.conf 5
.Sh HISTORY
The
.Nm
module first appeared in the
.Nm pqfreebsd_kernel
collection.
.Sh AUTHORS
.An Brian Fundakowski Feldman
.Sh BUGS
Unload does not clear
.Dv MNT_MULTILABEL
on mounts already tagged.
Remounts that change
.Cm xattr
are not observed until
.Va debug.pqk_zfs_ea.scan
is written or the module is reloaded.
